function points(input){
    let num = Number(input[0])
    let bonus = 0.0
//     •	Ако числото е до 100 включително, бонус точките са 5.
// •	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
// •	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
// •	Допълнителни бонус точки (начисляват се отделно от предходните):
// o	За четно число  + 1 т.
// o	За число, което завършва на 5  + 2 т.

    if(num <= 100){
         bonus = 5

    }else if(num > 1000){
         bonus = 0.1 * num
    } else{
        bonus = 0.20 * num
    }
    if(num % 2 === 0){
        bonus += 1
    }else if(num % 10 === 5){
        bonus += 2
    }
    console.log(bonus)
    console.log(num + bonus)
}
points(["175"])