function basketball(input){
    const training = Number(input[0]);
    // •	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
    const kec = training - (0.4 * training)
    // •	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
    const ekip = kec - (0.2 * kec)
    // •	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
    const ball = 1/4 * ekip
    // •	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
    const aksesories = 1/5 * ball
    // Обща цена за екипировката: 365 + 219 + 175.20 + 43.80 + 8.76 = 811.76
    const sum = training + kec + ball + aksesories + ekip
console.log(sum)
//     Цена на тренировките за година: 365
// Цена на баскетболните кецове: 365 – 40% = 219
// Цена на баскетболен екип: 219 – 20% = 175.20
// Цена на баскетболна топка: 1 / 4 от 175.20 = 43.80
// Цена на баскетболни аксесоари: 1 /  5 от 43.80 = 8.76
}
basketball(["365 "])